import "./Preview.scss";
import { useState, useRef } from "react";
import { IconCopy } from "@consta/uikit/IconCopy";
import { IconBookmarkStroked } from "@consta/uikit/IconBookmarkStroked";
import { IconSettings } from "@consta/uikit/IconSettings";
import { IconFunnel } from "@consta/uikit/IconFunnel";
import { IconChat } from "@consta/uikit/IconChat";
import { IconEdit } from "@consta/uikit/IconEdit";
import { IconPhoto } from "@consta/uikit/IconPhoto";
import { IconRing } from "@consta/uikit/IconRing";
import { IconCamera } from "@consta/uikit/IconCamera";
import { IconAdd } from "@consta/uikit/IconAdd";
import { IconHand } from "@consta/uikit/IconHand";
import { Attachment } from "@consta/uikit/Attachment";
import { Button } from "@consta/uikit/Button";
import { Checkbox } from "@consta/uikit/Checkbox";
import { ChoiceGroup } from "@consta/uikit/ChoiceGroup";
import { ContextMenu } from "@consta/uikit/ContextMenu";
import { Text } from "@consta/uikit/Text";
import { Collapse } from "@consta/uikit/Collapse";
import { Table } from "@consta/uikit/Table";
import { Informer } from "@consta/uikit/Informer";
import { Breadcrumbs } from "@consta/uikit/Breadcrumbs";
import {
  Header,
  HeaderModule,
  HeaderSearchBar,
  HeaderMenu,
  HeaderButton,
  HeaderLogin,
  HeaderLogo,
} from "@consta/uikit/Header";

const choiceGroupItems = [
  {
    name: "Первый",
    icon: IconPhoto,
  },
  {
    name: "Второй",
    icon: IconRing,
  },
  {
    name: "Третий вариант",
    icon: IconCamera,
  },
];
const contextMenuItems = ["Пункт 1", "Пункт 2", "Пункт 3"];

function Preview() {
  const [choiceGroupItem, setChoiceGroupItem] = useState(choiceGroupItems[0]);
  const ref = useRef(null);

  return (
    <div className="app">
      <div className="app__layout-wrapper-2">
        <div className="app__attachment">
          <Attachment
            fileName="Инструкция по сборке марсохода"
            fileExtension="pdf"
            fileDescription="1,5 Mб • 21.02.2051, 14:12"
            onClick={() => console.log("onClick")}
          />
          <Attachment
            fileName="Картинка в JPG"
            fileExtension="jpg"
            fileDescription="1,5 Mб 19.07.2020, 16:11"
            onClick={() => console.log("onClick")}
          />
        </div>

        <div className="app__button">
          <Button label="Размер XS" size="xs" />
          <Button label="Размер S" size="s" />
          <Button label="Размер M" size="m" />
          <Button label="Размер L" size="l" />
          <Button label="Развернуть" view="clear" />
          <Button label="Скопировать" view="clear" iconLeft={IconCopy} />
          <Button
            label="Добавить в Избранное"
            view="clear"
            iconLeft={IconBookmarkStroked}
            onlyIcon
          />
          <Button label="Отмена" view="ghost" />
          <Button label="Настройки" view="ghost" iconLeft={IconSettings} />
          <Button label="Фильтр" view="ghost" iconLeft={IconFunnel} onlyIcon />
          <Button label="Читать далее" view="secondary" />
          <Button label="Комментировать" view="secondary" iconLeft={IconChat} />
          <Button
            label="Редактировать"
            view="secondary"
            iconRight={IconEdit}
            onlyIcon
          />
          <Button
            label="Неактивная"
            // view="secondary"
            iconRight={IconEdit}
            disabled
          />
        </div>

        <div className="app__header">
          <Header
            leftSide={
              <>
                <HeaderModule>
                  <HeaderLogo>
                    <svg
                      width="40"
                      height="40"
                      viewBox="0 0 40 40"
                      fill="currentColor"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <g clip-path="url(#clip0_1783_29440)">
                        <path
                          d="M19.0038 25.1953C19.1346 25.1953 19.2624 25.2339 19.3712 25.3063C19.48 25.3789 19.5647 25.4818 19.6148 25.6023C19.6648 25.7228 19.6779 25.8554 19.6524 25.9832C19.6269 26.1111 19.5639 26.2286 19.4714 26.3208C19.379 26.413 19.2611 26.4758 19.1328 26.5013C19.0045 26.5267 18.8716 26.5136 18.7507 26.4638C18.6299 26.4138 18.5267 26.3293 18.454 26.2209C18.3813 26.1125 18.3425 25.985 18.3425 25.8546C18.343 25.6798 18.4128 25.5125 18.5368 25.3889C18.6607 25.2654 18.8286 25.1957 19.0038 25.1953ZM22.3846 25.0053C22.3727 24.925 22.3385 24.8496 22.2861 24.7876C22.2336 24.7256 22.1648 24.6793 22.0874 24.6541C22.0101 24.6288 21.9272 24.6256 21.8481 24.6447C21.7689 24.6637 21.6967 24.7044 21.6395 24.7621L20.6561 25.7406C20.5989 25.798 20.5588 25.8699 20.54 25.9486C20.5213 26.0273 20.5248 26.1096 20.55 26.1865C20.5753 26.2633 20.6213 26.3318 20.6831 26.3842C20.7448 26.4366 20.8199 26.471 20.9 26.4835L21.4908 26.5766L21.4489 26.3125L22.356 26.455L22.2131 25.5525L22.4761 25.5943L22.3846 25.0053ZM15.6135 21.205C15.6225 21.2868 15.6544 21.3645 15.7056 21.429C15.7567 21.4936 15.8249 21.5425 15.9027 21.5703C15.9803 21.598 16.0643 21.6034 16.1449 21.5859C16.2255 21.5683 16.2995 21.5286 16.3586 21.4711L17.342 20.483C17.3993 20.4259 17.4396 20.354 17.4584 20.2754C17.4772 20.1968 17.4737 20.1145 17.4485 20.0377C17.4232 19.9609 17.3771 19.8927 17.3153 19.8404C17.2533 19.7883 17.1782 19.7541 17.098 19.742L16.5073 19.6488L16.5473 19.913L15.6421 19.7705L15.785 20.673L15.5201 20.6312L15.6135 21.205ZM21.6147 24.4694L19.749 23.2363C20.425 22.6319 21.1672 22.1054 21.9615 21.6668C21.568 21.5736 21.2187 21.3482 20.9724 21.0283C20.9724 21.0283 19.9148 22.3584 19.1582 22.7954C20.2139 21.6953 20.6942 20.7794 20.8905 20.5875C21.1516 20.331 21.6948 20.6331 21.7385 20.9124C21.428 20.8212 21.3174 20.9865 21.4965 21.1594C21.7519 21.4103 22.1922 21.5756 22.3903 21.3817C22.5885 21.1879 22.4418 20.5932 21.9768 20.1391C21.5118 19.685 20.942 19.5026 20.7037 19.7344C20.4655 19.9662 20.0062 21.0454 18.8246 22.2938L17.8317 20.8003L16.3891 21.7485L18.1786 22.9322C17.3758 23.587 16.4798 24.1192 15.5201 24.5112C15.7966 24.6523 16.0622 24.8136 16.3148 24.9939C17.139 24.4663 17.9312 23.8908 18.6875 23.2705C18.1157 24.1027 16.7817 25.049 16.2443 25.4499C15.9984 25.6266 16.0537 26.0313 16.3548 26.3315C16.656 26.6317 17.0009 26.6583 17.2162 26.4493C17.4773 26.1947 17.9575 25.1022 19.122 23.8576L20.1587 25.4138L21.6147 24.4694ZM12.0059 12.7439C12.5928 12.2214 13.4428 12.2214 13.9345 12.3848C13.5795 12.0322 13.141 11.7747 12.6595 11.6362C12.4718 11.7575 12.315 11.9208 12.2015 12.1131C12.088 12.3054 12.0211 12.5214 12.0059 12.7439ZM14.512 29.0353C14.3595 28.9688 14.1308 28.8282 13.9783 28.3323C13.726 28.2936 13.4875 28.1924 13.2846 28.0378C12.9035 27.6577 13.0941 27.2207 13.1931 26.8977C12.7796 26.4056 12.8673 25.9705 13.1417 25.6969C13.3483 25.5263 13.5866 25.3981 13.843 25.3195C14.0994 25.2409 14.3688 25.2136 14.6358 25.239V24.3022C13.7306 24.021 12.8387 24.0989 12.1412 24.8039C11.3598 25.5924 11.1711 26.2327 10.1821 26.6184C10.5632 27.2663 11.236 27.3043 11.8077 27.2872C11.6875 27.738 11.4027 28.1277 11.0092 28.3798C11.3903 28.7598 12.0821 28.8985 12.6919 28.7408C12.6755 29.111 12.5847 29.4741 12.4251 29.8087C12.8103 29.9091 13.217 29.8887 13.5901 29.7504C13.9632 29.612 14.2844 29.3623 14.5101 29.0353H14.512ZM10.729 24.7374C11.2836 24.1179 11.6819 22.9436 11.9048 21.5756C12.7244 21.5756 14.0012 21.986 14.6339 22.9455V19.5387C13.8706 19.729 13.0787 19.7786 12.2974 19.685C10.9997 19.495 10.2716 18.545 10.2716 17.4049C10.2745 17.091 10.3427 16.7812 10.472 16.495C10.6013 16.2088 10.7888 15.9525 11.0225 15.7423C11.0473 15.7249 11.067 15.7011 11.0795 15.6736C11.092 15.646 11.0969 15.6155 11.0936 15.5855C11.0903 15.5554 11.0789 15.5267 11.0607 15.5025C11.0426 15.4783 11.0181 15.4594 10.9901 15.4478C10.9253 15.4155 10.891 15.3832 10.8262 15.3509C6.77266 12.8085 3.1117 6.87644 2.71911 6.23041C2.71343 6.22294 2.70608 6.21686 2.69765 6.21269C2.68922 6.20851 2.67993 6.20634 2.67052 6.20634C2.66111 6.20634 2.65182 6.20851 2.64339 6.21269C2.63496 6.21686 2.62761 6.22294 2.62192 6.23041C1.37937 7.30586 1.24787 9.46058 2.55713 11.1194C3.4071 12.2271 5.23662 13.4336 7.10045 14.4768C7.06806 14.6668 7.06806 14.8682 7.03375 15.064C3.23939 14.2507 0.790491 11.602 0.397905 11.1783C0.392218 11.1708 0.384871 11.1647 0.37644 11.1605C0.368009 11.1563 0.358723 11.1542 0.349308 11.1542C0.339894 11.1542 0.330608 11.1563 0.322177 11.1605C0.313746 11.1647 0.306399 11.1708 0.300712 11.1783C-0.417759 12.5482 0.203518 14.4084 1.60806 15.1875C2.81822 15.8715 4.74684 16.2629 7.13475 16.5574C7.16716 16.719 7.19955 16.8824 7.23195 17.0781C4.91199 17.3824 2.55309 17.0205 0.432209 16.0349C0.397905 16.0026 0.365507 16.0349 0.33311 16.0672C0.169214 17.5341 1.08588 18.7084 2.68672 19.001C4.28946 19.229 7.68933 18.4139 7.68933 18.4139C7.75129 18.5725 7.82785 18.7252 7.91801 18.8699C5.69401 20.141 2.52283 20.0099 2.06544 19.9795C2.04869 19.9808 2.03296 19.988 2.02109 19.9999C2.0092 20.0118 2.00196 20.0274 2.00064 20.0441C2.03305 21.5756 3.53668 21.9993 4.87644 21.8359C6.01989 21.6744 7.62263 20.9238 8.73367 20.0764C8.84553 20.204 8.96586 20.3241 9.09388 20.4355C8.01523 22.195 5.49771 22.9056 4.64774 22.9779C4.61535 22.9779 4.58295 23.0102 4.61535 23.0425C5.17182 23.9925 6.38007 24.2813 7.72173 23.6619C8.50503 23.2705 9.48646 22.2919 10.1725 21.1917L10.6623 21.3817C10.2374 23.5004 8.14673 24.7716 7.78653 24.9673C7.75413 24.9673 7.75413 25.0319 7.78653 25.0319C8.40782 25.714 9.84667 25.7482 10.729 24.7374ZM14.1022 4.52983L13.4485 3.74889L12.7872 4.52983L13.4409 5.32027L14.1022 4.52983ZM6.64307 9.28957C7.00135 9.02737 8.27632 8.311 7.95039 9.66958C8.105 9.62065 8.24093 9.52589 8.34005 9.39788C8.43917 9.26986 8.49672 9.11477 8.50503 8.95327C8.50503 8.0735 7.29674 7.68208 7.29674 6.83464C7.29674 5.59578 9.29013 5.59578 9.22537 5.79149C8.86516 6.89925 9.55122 8.3015 11.4475 8.3661V8.1153C9.84667 8.1153 9.12625 6.42042 10.3689 5.24806C9.68272 3.15796 8.66891 5.24806 7.81892 5.80099C7.32914 6.0955 5.98939 5.93209 5.89029 6.51922C5.76071 7.43127 7.32914 7.39897 6.64307 9.28957ZM24.0655 12.3848C24.3916 12.2801 24.7387 12.2581 25.0754 12.3208C25.4122 12.3835 25.728 12.5289 25.9941 12.7439C25.9796 12.5219 25.9135 12.3062 25.8011 12.114C25.6886 11.9217 25.5328 11.7582 25.3462 11.6362C24.8627 11.7738 24.422 12.0314 24.0655 12.3848ZM25.8588 24.8039C25.1594 24.0989 24.2694 24.021 23.3622 24.3022V25.2409C23.9021 25.1899 24.4402 25.3546 24.8583 25.6988C25.1308 25.9724 25.2185 26.4075 24.8069 26.8996C24.9002 27.2207 25.0889 27.6596 24.7135 28.0397C24.511 28.1948 24.2723 28.2961 24.0198 28.3342C23.8673 28.8301 23.6386 28.9707 23.488 29.0372C23.7138 29.3646 24.0354 29.6144 24.4088 29.7528C24.7823 29.8913 25.1895 29.9114 25.5749 29.8106C25.4153 29.476 25.3245 29.1129 25.3081 28.7427C25.9179 28.9004 26.6116 28.7598 26.9908 28.3817C26.5967 28.1303 26.3117 27.7403 26.1923 27.2891C26.764 27.3062 27.4425 27.2682 27.8179 26.6203C26.8289 26.2327 26.6382 25.5924 25.8588 24.8039ZM37.5659 16.0349C35.445 17.0203 33.0861 17.3822 30.7661 17.0781C30.7985 16.8881 30.8329 16.719 30.8653 16.5574C33.2513 16.2629 35.1798 15.8715 36.392 15.1875C37.7965 14.4046 38.4178 12.5482 37.6993 11.1783C37.6934 11.1707 37.6859 11.1647 37.6773 11.1605C37.6687 11.1563 37.6593 11.1542 37.6498 11.1542C37.6402 11.1542 37.6308 11.1563 37.6221 11.1605C37.6136 11.1647 37.6061 11.1707 37.6002 11.1783C37.2076 11.602 34.7568 14.2431 30.9644 15.0583C30.9319 14.8682 30.9319 14.6668 30.8995 14.4711C32.7634 13.4279 34.5929 12.2214 35.4428 11.1137C36.7502 9.45107 36.6206 7.30016 35.3781 6.22471C35.3722 6.2172 35.3647 6.21114 35.3561 6.20697C35.3475 6.20279 35.3381 6.20063 35.3285 6.20063C35.3189 6.20063 35.3095 6.20279 35.301 6.20697C35.2923 6.21114 35.2848 6.2172 35.279 6.22471C34.8883 6.87644 31.2254 12.8085 27.1719 15.3452C27.1071 15.3775 27.0747 15.4098 27.0099 15.4421C26.9819 15.4537 26.9574 15.4726 26.9393 15.4968C26.9211 15.521 26.9097 15.5497 26.9064 15.5798C26.9031 15.6098 26.908 15.6403 26.9205 15.6679C26.933 15.6954 26.9527 15.7192 26.9775 15.7366C27.2112 15.9468 27.3987 16.2031 27.528 16.4893C27.6573 16.7755 27.7255 17.0853 27.7284 17.3992C27.7284 18.5393 27.0003 19.4893 25.7026 19.6793C24.9206 19.7729 24.1282 19.7233 23.3642 19.533V22.9398C24.0064 21.9803 25.2699 21.5699 26.0933 21.5699C26.3238 22.9379 26.7145 24.1122 27.271 24.7317C28.1533 25.7425 29.5922 25.7083 30.2135 25.0243C30.2459 25.0243 30.2459 24.9597 30.2135 24.9597C29.8533 24.7697 27.7607 23.4928 27.3358 21.3741L27.8275 21.1841C28.5135 22.2919 29.4931 23.2743 30.2782 23.6543C31.6123 24.2737 32.8282 23.9792 33.3828 23.0349C33.417 23.0026 33.3828 22.9702 33.3504 22.9702C32.5004 22.9037 29.9848 22.1874 28.9061 20.4279C29.0336 20.3165 29.1533 20.1964 29.2644 20.0688C30.3755 20.9162 31.9782 21.6668 33.1217 21.8283C34.4557 21.9917 35.9669 21.568 35.9994 20.0365C35.998 20.0195 35.9904 20.0036 35.9782 19.9917C35.9659 19.9798 35.9497 19.9728 35.9326 19.9719C35.4753 20.0042 32.3117 20.1334 30.082 18.8623C30.1722 18.7176 30.2487 18.5649 30.3107 18.4063C30.3107 18.4063 33.7105 19.2214 35.3132 18.9934C36.9142 18.7008 37.8288 17.5265 37.665 16.0596C37.6307 16.0349 37.5983 16.0026 37.5659 16.0349ZM25.209 4.52983L24.5553 3.74889L23.9016 4.52983L24.5553 5.32027L25.209 4.52983ZM28.7765 5.80099C28.7118 5.61098 30.7052 5.61098 30.7052 6.84414C30.7052 7.69159 29.495 8.083 29.495 8.96277C29.5034 9.12451 29.5613 9.27976 29.6607 9.40777C29.7602 9.53586 29.8966 9.63047 30.0515 9.67908C29.7237 8.311 31.0044 9.02737 31.3589 9.29907C30.6727 7.39897 32.2412 7.44077 32.1116 6.52872C32.0125 5.9416 30.6727 6.10501 30.183 5.81049C29.333 5.25756 28.3192 3.17126 27.633 5.25756C28.8737 6.42992 28.1552 8.1248 26.5544 8.1248V8.3851C28.4449 8.311 29.1329 6.90875 28.7765 5.80099ZM12.2327 8.4421H14.6834C16.7436 8.4421 17.6584 7.17096 17.9518 6.0955H20.0482C20.3435 7.17096 21.2583 8.4421 23.3166 8.4421H25.7654C25.9768 8.15393 26.163 7.84812 26.3219 7.52817C26.7031 6.51922 26.2229 6.029 25.5043 6.029L24.5515 6.87644L23.5719 6.0613C22.8515 6.0613 22.3617 6.51923 22.7543 7.56048C22.8192 7.69159 22.945 7.8873 23.0478 8.0507C22.1655 7.9196 21.0544 7.33246 20.8257 6.0613C21.1286 5.60165 21.4018 5.12312 21.6433 4.62863C22.2302 3.16176 21.4794 2.53853 20.4007 2.53853L18.9981 4.18021L17.5935 2.54993C16.5149 2.54993 15.7621 3.16936 16.351 4.64003C16.5925 5.13452 16.8656 5.61306 17.1686 6.0727C16.9398 7.34386 15.8345 7.931 14.9445 8.0621C15.0436 7.8987 15.1732 7.70299 15.24 7.57188C15.6325 6.53062 15.1409 6.0727 14.4223 6.0727L13.4409 6.88784L12.4881 6.0404C11.7696 6.0404 11.2778 6.53062 11.6704 7.53958C11.8318 7.8558 12.0199 8.15773 12.2327 8.4421ZM19.9148 1.10776L18.9981 0L18.0833 1.10776L18.9981 2.28011L19.9148 1.10776ZM26.6154 11.2106C26.8171 11.227 27.0099 11.2999 27.1718 11.421C27.3336 11.542 27.4579 11.7062 27.5301 11.8946C27.7588 11.7046 27.9876 11.0472 27.8903 10.5912C27.4978 8.501 22.6591 9.87288 20.2082 8.99318C20.1435 9.58028 20.9591 10.557 21.7119 10.9161C20.4046 12.0561 19.2344 14.3362 18.9981 17.1085C18.7694 14.3381 17.5935 12.0561 16.2862 10.9161C17.0371 10.557 17.8546 9.58598 17.7899 8.99318C15.3371 9.88048 10.5004 8.5067 10.1001 10.5931C10.001 11.0491 10.2297 11.7008 10.4603 11.8965C10.5326 11.7081 10.6568 11.5439 10.8187 11.4229C10.9805 11.3018 11.1734 11.2289 11.3751 11.2125C13.8526 10.8325 16.0632 13.5173 16.0632 15.8221C16.077 16.4209 15.9549 17.0151 15.706 17.5603C15.4573 18.1054 15.0881 18.5875 14.6263 18.9705L18.9905 17.9046L23.3546 18.9705C22.8932 18.5873 22.5244 18.1052 22.2759 17.56C22.0274 17.0148 21.9057 16.4208 21.9196 15.8221C21.9273 13.5173 24.136 10.8306 26.6154 11.2106ZM20.0767 30.506C20.5017 29.3318 21.0411 28.1214 21.9596 28.1214C22.4094 28.1214 22.8096 28.5508 23.1031 28.5983C23.1645 28.6119 23.2285 28.6062 23.2865 28.582C23.3445 28.5579 23.3936 28.5165 23.4271 28.4634C23.531 28.2893 23.596 28.0949 23.6176 27.8934C23.8438 27.8752 24.0664 27.826 24.2789 27.7471C24.3373 27.7265 24.3864 27.686 24.4178 27.6329C24.4492 27.5797 24.4608 27.5172 24.4505 27.4563C24.4154 27.2268 24.3406 27.0049 24.2294 26.8008C24.3724 26.6795 24.4897 26.5309 24.5744 26.3638C24.6013 26.308 24.6084 26.2447 24.5946 26.1843C24.5807 26.1239 24.5467 26.0699 24.4981 26.0313C24.1767 25.8033 23.7835 25.6988 23.3909 25.7368H23.3737V26.4113C23.3831 26.5649 23.3602 26.7188 23.3064 26.8632C23.2528 27.0075 23.1694 27.139 23.0618 27.2494C22.9541 27.3598 22.8246 27.4465 22.6814 27.504C22.5382 27.5616 22.3845 27.5887 22.2302 27.5836H20.9496C20.5668 27.5749 20.1879 27.6626 19.8481 27.8386C19.5083 28.0146 19.2186 28.2733 19.0057 28.5907C18.7933 28.2733 18.5039 28.0146 18.1644 27.8386C17.8249 27.6626 17.4464 27.5749 17.0637 27.5836H15.7755C15.6212 27.5884 15.4677 27.5611 15.3247 27.5035C15.1816 27.4457 15.0522 27.359 14.9446 27.2488C14.837 27.1384 14.7537 27.007 14.6998 26.8628C14.6461 26.7187 14.623 26.5649 14.632 26.4113V25.7444H14.6168C14.2251 25.7049 13.8322 25.8067 13.5095 26.0313C13.4613 26.0702 13.4276 26.1242 13.4141 26.1846C13.4006 26.245 13.4081 26.3082 13.4352 26.3638C13.5193 26.5313 13.6366 26.68 13.7801 26.8008C13.6689 27.0049 13.5941 27.2268 13.559 27.4563C13.5488 27.5172 13.5604 27.5797 13.5917 27.6329C13.6231 27.686 13.6722 27.7265 13.7306 27.7471C13.9432 27.8261 14.1657 27.8754 14.3919 27.8934C14.4135 28.0949 14.4785 28.2893 14.5824 28.4634C14.6159 28.5165 14.665 28.5579 14.723 28.582C14.781 28.6062 14.8451 28.6119 14.9065 28.5983C15.198 28.5508 15.5963 28.1214 16.0499 28.1214C16.9684 28.1214 17.5059 29.3318 17.9309 30.506C15.8345 30.9944 13.2237 32.3966 12.7015 33.9262C12.5109 34.5133 13.1588 35.2942 13.9764 35.4576C14.0089 35.4576 14.0412 35.4576 14.0412 35.4253C14.4662 33.1757 16.9189 31.4808 18.1938 31.1882C18.2587 31.3516 18.2262 31.3193 18.2911 31.4808C16.9189 32.1344 15.5772 33.5025 15.1846 35.1327C15.0227 35.8814 15.8402 36.5654 16.5187 36.7288C16.5511 36.7288 16.5835 36.7288 16.5835 36.6965C16.715 34.6425 17.6298 32.8831 18.4473 32.0679C18.4797 32.2313 18.4797 32.3947 18.5121 32.524C18.5121 32.524 17.6622 34.8705 17.6622 36.5654C17.6622 37.3483 18.8399 37.8955 18.9962 38C19.1601 37.9031 20.3302 37.3483 20.3302 36.5654C20.3302 34.8705 19.4802 32.524 19.4802 32.524C19.5127 32.3947 19.5127 32.2313 19.5451 32.0679C20.3626 32.8831 21.2774 34.6425 21.4089 36.6965C21.4089 36.7288 21.4413 36.7288 21.4736 36.7288C22.1598 36.5654 22.9773 35.8814 22.8077 35.1327C22.4151 33.5025 21.0754 32.1344 19.7032 31.4808C19.768 31.3193 19.7356 31.3516 19.8005 31.1882C21.0754 31.4808 23.5281 33.1757 23.9531 35.4253C23.9531 35.4576 23.9854 35.4576 24.0178 35.4576C24.8355 35.2942 25.4891 34.5076 25.2928 33.9262C24.784 32.3966 22.1693 30.9944 20.0767 30.506Z"
                          fill="currentColor"
                        />
                      </g>
                      <defs>
                        <clipPath id="clip0_1783_29440">
                          <rect width="40" height="40" />
                        </clipPath>
                      </defs>
                    </svg>
                  </HeaderLogo>
                </HeaderModule>
                <HeaderModule indent="l">
                  <HeaderSearchBar
                    placeholder="я ищу"
                    label="поиск"
                    value={""}
                    onChange={() => {}}
                    onSearch={() => {}}
                  />
                </HeaderModule>
                <HeaderModule indent="l">
                  <HeaderMenu
                    items={[
                      {
                        label: "Проекты",
                        href: "#projects",
                        active: true,
                      },
                      {
                        label: "Задачи",
                        href: "#tasks",
                      },
                      {
                        label: "Еще",
                        onClick: () => alert("Еще"),
                      },
                    ]}
                  />
                </HeaderModule>
              </>
            }
            rightSide={
              <>
                <HeaderModule indent="s">
                  <HeaderButton iconLeft={IconRing} />
                </HeaderModule>
                <HeaderModule indent="s">
                  <HeaderButton iconLeft={IconChat} />
                </HeaderModule>
                <HeaderModule indent="s">
                  <HeaderLogin
                    isLogged={true}
                    personName="Илья Колебаев"
                    personInfo="В другом офисе"
                    personStatus="available"
                    onClick={() => {}}
                  />
                </HeaderModule>
              </>
            }
          />
        </div>

        <div className="app__checkbox mix__2-col-row">
          <Checkbox
            align="center"
            label="Длинный текст для чекбокса с выравниванием по центру, здесь несколько строк"
          />
          <Checkbox
            align="top"
            label="Длинный текст для чекбокса с выравниванием по верху, здесь несколько строк"
            checked
          />
          <Checkbox align="top" label="Выбран неактивный" checked disabled />
        </div>

        <div className="app__choicegroup mix__2-col-row">
          <ChoiceGroup
            value={choiceGroupItem}
            onChange={({ value }) => setChoiceGroupItem(value)}
            items={choiceGroupItems}
            getLabel={(item) => item.name}
            getIcon={(item) => item.icon}
            multiple={false}
          />
          <ChoiceGroup
            value={choiceGroupItem}
            onChange={({ value }) => setChoiceGroupItem(value)}
            items={choiceGroupItems}
            getLabel={(item) => item.name}
            getIcon={(item) => item.icon}
            onlyIcon
            multiple={false}
          />
        </div>

        <div className="app__contextmenu">
          <Button iconLeft={IconAdd} ref={ref} />
          <ContextMenu
            items={contextMenuItems}
            getLabel={(item) => item}
            anchorRef={ref}
            direction="downLeft"
            getDisabled={contextMenuItems[1]}
          />
        </div>

        <div className="app__text">
          <Text
            as="div"
            align="left"
            font="sans"
            lineHeight="l"
            size="2xl"
            spacing="s"
            transform="uppercase"
            view="primary"
            weight="bold"
          >
            Заголовок
          </Text>
          <Text
            as="p"
            align="left"
            font="serif"
            lineHeight="s"
            size="s"
            view="primary"
          >
            Абзац — это часть текста между отступами с новой строки. Абзац можно
            назвать микротекстом. В общей теме могут выделяться и микротемы. При
            этом каждый абзац раскрывает свою микротему. Что же ещё можно
            сказать про абзацы? Мы видим, что обычно в абзацах несколько
            предложений. В таком случае каждый абзац служит для выделения своей
            микротемы.
          </Text>
          <Text
            as="p"
            align="left"
            font="serif"
            lineHeight="s"
            size="s"
            view="secondary"
          >
            Абзац — это часть текста между отступами с новой строки. Абзац можно
            назвать микротекстом. В общей теме могут выделяться и микротемы. При
            этом каждый абзац раскрывает свою микротему. Что же ещё можно
            сказать про абзацы? Мы видим, что обычно в абзацах несколько
            предложений. В таком случае каждый абзац служит для выделения своей
            микротемы.
          </Text>
          <Text
            as="p"
            align="left"
            font="serif"
            lineHeight="s"
            size="s"
            view="ghost"
          >
            Абзац — это часть текста между отступами с новой строки. Абзац можно
            назвать микротекстом. В общей теме могут выделяться и микротемы. При
            этом каждый абзац раскрывает свою микротему. Что же ещё можно
            сказать про абзацы? Мы видим, что обычно в абзацах несколько
            предложений. В таком случае каждый абзац служит для выделения своей
            микротемы.
          </Text>
          <Text
            as="a"
            align="left"
            font="serif"
            lineHeight="s"
            size="l"
            view="link"
          >
            Тест ссылки
          </Text>
          <Text
            align="left"
            size="6xl"
            view="primary"
            style={{
              fontFamily: "var(--font-secondary)",
              lineHeight: "100%",
              fontStyle: "italic",
              marginTop: "40px",
            }}
            font="secondary"
          >
            Заголовок
          </Text>
          <Text
            as="p"
            align="left"
            size="xl"
            view="primary"
            style={{ fontFamily: "var(--font-secondary)" }}
            font="secondary"
          >
            Абзац — это часть текста между отступами с новой строки. Абзац можно
            назвать микротекстом. В общей теме могут выделяться и микротемы. При
            этом каждый абзац раскрывает свою микротему. Что же ещё можно
            сказать про абзацы? Мы видим, что обычно в абзацах несколько
            предложений. В таком случае каждый абзац служит для выделения своей
            микротемы.
          </Text>
        </div>

        <div className="app__collapse">
          <Collapse
            label="Здесь есть разделитель"
            isOpen={true}
            onClick={() => {}}
            divider
          >
            <Text align="left" font="serif" size="m" view="primary">
              Абзац — это часть текста между отступами с новой строки. Абзац
              можно назвать микротекстом. В общей теме могут выделяться и
              микротемы. При этом каждый абзац раскрывает свою микротему. Что же
              ещё можно сказать про абзацы? Мы видим, что обычно в абзацах
              несколько предложений. В таком случае каждый абзац служит для
              выделения своей микротемы.
            </Text>
          </Collapse>
        </div>

        <div className="app__table">
          <Table
            columns={[
              {
                title: "№",
                accessor: "id",
                align: "center",
                width: 100,
                sortable: true,
              },
              {
                title: "Имя",
                accessor: "name",
                sortable: true,
              },
              {
                title: "Фамииля",
                accessor: "surname",
                sortable: true,
              },
              {
                title: "Пол",
                accessor: "gender",
                sortable: true,
              },
              {
                title: "Возраст",
                accessor: "age",
                sortable: true,
              },
            ]}
            rows={[
              {
                id: "1",
                name: "Антон",
                gender: "мужчина",
                age: "30",
                surname: "Антонов",
              },
              {
                id: "2",
                name: "Василиса",
                gender: "женщина",
                age: "29",
                surname: "Иванова",
              },
              {
                id: "3",
                name: "Дмитрий",
                gender: "—",
                age: "25",
                surname: "Гаврилов",
              },
              {
                id: "4",
                name: "Анна",
                gender: "женщина",
                age: "—",
                surname: "Игнатьева",
              },
              {
                id: "5",
                name: "Даниил",
                gender: "мужчина",
                age: "20",
                surname: "Симонов",
              },
            ]}
          />
        </div>

        <div className="app__informer mix__2-col-row">
          <Informer
            status="success"
            view="filled"
            title="Всё хорошо — это 'success'"
            label="Подходит, чтобы рассказать об успешном результате процесса, в котором сейчас находится пользователь"
          />
          <Informer
            status="warning"
            view="filled"
            title="Внимание — это 'alert'"
            label="Здесь можно написать важную информацию, которая может понадобиться прямо сейчас. Например, о каких-то ограничениях"
          />
          <Informer
            status="alert"
            view="filled"
            title="Не получилось — это 'warning'"
            label="Подходит, чтобы рассказать об ошибке в процессе"
          />
          <Informer
            status="system"
            view="filled"
            title="Важно, но не критично — это 'system'"
            label="Это просто информация, которую стоит выделить"
          />
        </div>

        <div className="app__breadcrumbs">
          <Breadcrumbs
            className="myClassName"
            pages={[
              {
                icon: IconHand,
                label: "Home",
                link: "https://url.com",
              },
              {
                label: "Page1",
                link: "https://url.com/page-1",
              },
              {
                label: "Page2",
                link: "https://url.com/page-2",
              },
              {
                label: "Page3",
                link: "https://url.com/page-3",
                isActive: true,
              },
              {
                label: "Page4",
                link: "https://url.com/page-3",
              },
              {
                label: "Page5",
                link: "https://url.com/page-3",
              },
              {
                label: "Page6",
                link: "https://url.com/page-3",
              },
              {
                label: "Page7",
                link: "https://url.com/page-3",
              },
            ]}
            size={"m"}
            maxCount={10}
            onlyIconRoot={true}
            getLabel={(page) => page.label}
            getIsActive={(page) => !!page.isActive}
            getLink={(page) => page.link}
            getIcon={(page) => page.icon}
            onClick={(page, e) => {
              e.preventDefault();
              console.log(page.link, e);
            }}
          />
        </div>
      </div>
    </div>
  );
}

export default Preview;
